Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Answer all the questions and your lambda will be deployed and the necessary hooks to the API Gateway will be set up. If everything deploys successfully, the root URL of your microservice will be output to the console. Something like this:
zh_cn: 回答所有的问题，你的lambda将被部署，必要的钩子将被设置到API网关。如果一切部署成功，你的微服务的根URL将被输出到控制台。类似这样：

source: Any other class
zh_cn: 任何其他类

source: Any type which can be converted to one of the two previous types using Reactive Type Converters
zh_cn: 任何可以使用响应式类型转换器转换为前两种类型之一的类型

source: Any user is allowed to access the `http://localhost:8080/api/users/me` endpoint which basically returns a JSON payload with details about the user.
zh_cn: 任何用户都被允许访问 `<a href="http://localhost:8080/api/users/me" class="bare">http://localhost:8080/api/users/me</a>` 节点，该节点会返回一个包含用户详细信息的JSON payload。

source: Any you files and directories you create under your zip directory will be included within `function.zip`
zh_cn: 你在zip目录下创建的任何文件和目录都将包括在 `function.zip` 内

source: Anyone can post to this list. The subscribers are only trusted individuals from the Quarkus community who will handle the resolution of any reported security issues in confidence. In your report, please note how you would like to be credited for discovering the issue and the details of any embargo you would like to impose. Currently the security response teams for the following distributions are subscribed to this list and will respond to your report:
zh_cn: 任何人都可以在这个列表上发帖。订阅者仅是来自Quarkus社区的受信任的个人，他们将在保密的情况下处理任何报告的安全问题的解决方案。请在你的报告中注明你希望因发现该问题而获得的荣誉，以及你希望实施的任何禁运措施的细节。目前，以下发行版的安全响应团队已经订阅了这个列表，并将对您的报告作出响应：

source: Apache Kafka Reference Guide
zh_cn: Apache Kafka参考指南

source: Apache-2.0 License
zh_cn: Apache-2.0许可证

source: Apart from application-specific metrics, which are described in this guide, you may also utilize built-in metrics exposed by various Quarkus extensions. These are described in the guide for each particular extension that supports built-in metrics.
zh_cn: 除了在本指南中所述的一些的应用特定的metrics之外，您也可以利用各种Quarkus扩展所暴露的内置metrics。这些将在支持内置metrics的每个特定扩展的指南中描述。

source: Application Configuration
zh_cn: 应用配置

source: Application Health & Metrics
zh_cn: 应用健康和指标

source: Application Initialization and Termination
zh_cn: 应用程序的初始化和终止

source: Application requirements have changed drastically over the last few years. For any application to succeed in the era of cloud computing, Big Data, or IoT, going reactive is increasingly becoming the architecture style to follow.
zh_cn: 在过去的几年里，应用需求发生了巨大的变化。任何应用要想在云计算、大数据或物联网时代取得成功，采取响应式的做法正日益成为应遵循的架构风格。

source: Applications send and receive *messages*. A message wraps a _payload_ and can be extended with some _metadata_. With the Kafka connector, a _message_ corresponds to a Kafka _record_.
zh_cn: 应用程序发送和接收 *messages* 。一条消息包含一个 _payload_ ，并可以用一些 _metadata_ 进行扩展。通过Kafka connector，一条 _message_ 对应于一条Kafka _record_。

source: Applications streaming data often need to consume some events from a topic, process them and publish the result to a different topic. A processor method can be simply implemented using both the `@Incoming` and `@Outgoing` annotations:
zh_cn: 应用的流式数据常常需要从一个topic中消费一些事件，对其进行处理并将结果发布到不同的topic中。一个处理器方法可以简单地通过使用 `@Incoming` 和 `@Outgoing` 注解来实现：

source: Applying Interceptors to Tests
zh_cn: 在测试中使用拦截器

source: ArC comes as a dependency of `quarkus-resteasy-reactive` so you already have it handy.
zh_cn: ArC作为 `quarkus-resteasy-reactive` 的一个依赖项，所以你已经有了。

source: Arc, the dependency injection framework used by Quarkus, eliminates all the reflection calls and deduces the injection graph at build time. So, when the application starts, no expensive lookups; it’s done already!
zh_cn: Arc是Quarkus使用的依赖注入框架，它消除了所有的反射调用，并在构建时推断出注入图。因此，当应用程序启动时，不需要昂贵的查找，它已经完成了!

source: Architecture
zh_cn: 应用结构

source: As MongoDB with Panache allows writing simplified queries, it is sometimes handy to log the generated native queries for debugging purpose.
zh_cn: 由于带有Panache的MongoDB允许编写简化的查询，有时为调试目的而记录生成的原生查询是很方便的。

source: As a consequence, it’s not possible to change the destination dynamically (using message metadata) when using RabbitMQ.
zh_cn: 因此，在使用 RabbitMQ 时，不可能动态改变目的地（使用消息元数据）。

source: As a test annotated with `@QuarkusIntegrationTest` tests the result of the build, it should be run as part of the integration test suite - i.e. by setting `-DskipITs=false` if using Maven or the `quarkusIntTest` task if using Gradle. These tests will **not** work if run in the same phase as `@QuarkusTest` as Quarkus has not yet created the final artifact.
zh_cn: 由于用 `@QuarkusIntegrationTest` 注释的测试是对构建结果的测试，它应该作为集成测试套件的一部分来运行--即如果使用Maven，则设置 `-DskipITs=false`，而如果使用Gradle，则通过 `quarkusIntTest` 任务。如果与 `@QuarkusTest` 在同一阶段运行，这些测试将 *无法* 工作，因为Quarkus还没有产生出最终的artifact。

source: As above, commands can be stacked. The only requirement is that `native` be the first parameter should you wish to work with native image builds. The script will take care of the rest of the details necessary to manage your native image function deployments.
zh_cn: 如上所述，命令可以叠加。如果你想使用原生镜像构建，唯一的要求是 `native` 是第一个参数。该脚本将处理管理你原生镜像功能部署所需的其余细节。

source: As an example, in order to register all methods of class `com.acme.MyClass` for reflection, we create `reflection-config.json` (the most common location is within `src/main/resources`)
zh_cn: 作为一个例子，为了注册类 `com.acme.MyClass` 的所有方法进行反射，我们创建 `reflection-config.json` （最常见的位置是在 `src/main/resources` 内）

source: As before, the UI is exposed on http://localhost:8080/quotes.html
zh_cn: 与之前一样，UI也是在 http://localhost:8080/quotes.html

source: As by default, `MongoClient` is configured to access a local MongoDB database on port 27017 (the default MongoDB port), if you have a local running database on this port, there is nothing more to do before being able to test it!
zh_cn: 在默认情况下， `MongoClient` 被配置为在27017端口（默认的MongoDB端口）上访问本地的MongoDB数据库，如果你在这个端口上有一个本地运行的数据库，那么在能够测试之前，不需要做其他操作！

source: As explained in https://access.redhat.com/documentation/en-us/red_hat_openshift_streams_for_apache_kafka/1/guide/88e1487a-2a14-4b35-85b9-a7a2d67a37f3[Getting started with the rhoas CLI for Red Hat OpenShift Streams for Apache Kafka], to use Red Hat OpenShift Streams for Apache Kafka, you must create the topic beforehand, create a _Service Account_, and provide permissions to read and write to your topic from that service account. The authentication data (client id and secret) relates to the service account, which means you can implement fine-grain permissions and restrict access to the topic.
zh_cn: 正如在《 link:https://access.redhat.com/documentation/en-us/red_hat_openshift_streams_for_apache_kafka/1/guide/88e1487a-2a14-4b35-85b9-a7a2d67a37f3[红帽OpenShift Streams for Apache Kafka的 `rhoas` 命令行入门] 》中所解释的那样，要使用红帽OpenShift Streams for Apache Kafka，您必须事先创建topic，创建一个 _Service Account_ ，并提供从该服务账户读取和写入topic的权限。认证数据(客户端ID和密码)与服务账户有关，这意味着您可以实现细粒度的权限，并限制对topic的访问。

source: As for the Java Properties format, you can define your own profile:
zh_cn: 至于Java Properties 格式，你可以定义你自己的环境配置:

source: As for the reactive APIs exposed by Quarkus, stream manipulation uses the Mutiny API.
zh_cn: 那么Quarkus的采用Mutiny API作为响应式API来进行流操作。

source: As indicated in the property name, it uses Vert.x to retrieve the DNS records. By default, it tries to read the first `nameserver` from `/etc/resolv.conf`, if this file exists. You can also configure your DNS server:
zh_cn: 如属性名称所示，它使用 Vert.x 检索 DNS 记录。默认情况下，如果此文件存在，它会尝试从 `etcresolv.conf` 中读取第一个 `nameserver`。您还可以这样配置 DNS 服务器：

source: As is the case with `@NativeImageTest`, this is a black box test that supports the same set features and has the same limitations.
zh_cn: 如同 `@NativeImageTest` ，这是一个黑盒测试，支持相同的功能集且具有相同的限制。

source: As it uses a dedicated JDBC driver, you must configure your datasource and Hibernate ORM to use it.
zh_cn: 由于它使用专用的JDBC驱动，您必须配置您的数据源和Hibernate ORM来使用它。

source: As mentioned above Quarkus tests are actually full CDI beans, and as such you can apply CDI interceptors as you would normally. As an example, if you want a test method to run within the context of a transaction you can simply apply the `@Transactional` annotation to the method and the transaction interceptor will handle it.
zh_cn: 如上所述，Quarkus测试实际上是完整的CDI Bean，因此您可以自由的使用CDI拦截器。举个例子，如果您想让测试方法在事务上下文中运行，您可以将 `@Transactional` 注解加到该方法上，之后事务拦截器将会处理。

source: As mentioned above, in this guide, we are going to implement a reactive CRUD application. But you may wonder what the differences and benefits are in comparison to the traditional and imperative model.
zh_cn: 如上所述，在本指南中，我们将实现一个响应式CRUD应用程序。但您可能想知道，与传统的、指令式的模式相比，它有什么不同和好处。

source: As mentioned above, the issue is that Quarkus was not able to determine the `Legume` class will require some reflection by analyzing the REST endpoints. The JSON serialization library tries to get the list of fields of `Legume` and gets an empty list so it does not serialize the fields' data.
zh_cn: 如上所述，问题是Quarkus无法通过分析REST节点来确定 `Legume` 类将需要一些反射。JSON序列化库试图获取 `Legume` 的字段列表，但得到的是一个空列表，所以它没有序列化字段的数据。

source: As mentioned above, the method can also override the acknowledgment strategy to `PRE_PROCESSING` or `NONE`.
zh_cn: 如上所述，该方法还可以将确认策略设置为 `PRE_PROCESSING` 或 `NONE` 。

source: As mentioned in <4>, you need a deserializer that can create a `Fruit` from the record. This can be done using a Jackson deserializer:
zh_cn: 正如<4>中提到的，您需要一个能从记录中重建 `Fruit` 对象的反序列化器。可以使用Jackson的反序列化器来完成：

source: As much as possible Quarkus tries to avoid reflection, reducing startup time and memory usage. During the built-time processing, extensions can analyze the application code and the classes available on the classpath and replace reflection calls with regular invocations. The usage of dynamic proxies is also prevented by using generating custom proxy at build time.
zh_cn: Quarkus尽可能地避免反射，减少启动时间和内存使用。在构建时的处理过程中，扩展可以分析应用程序代码和classpath上可用的类，并以常规调用取代反射调用。通过在构建时使用生成的自定义代理，也可以防止使用动态代理。

source: As much processing as possible is done at build time; thus, your application only contains the classes used at runtime. In traditional frameworks, all the classes required to perform the initial application deployment hang around for the application’s life, even though they are only used once. With Quarkus, they are not even loaded into the production JVM! Quarkus does not stop here. During the build-time processing, it prepares the initialization of all components used by your application. It results in less memory usage and faster startup time as all metadata processing has already been done.
zh_cn: 尽可能将更多的处理在构建时完成；因此，你的应用程序只包含在运行时使用的类。在传统的框架中，所有执行初始应用部署所需的类都在应用的生命周期中存在，尽管它们只被使用一次。在Quarkus中，它们甚至不会被加载到生产用的JVM中。Quarkus并没有到此为止。在构建时的处理过程中，它为你的应用程序使用的所有组件的初始化做准备。由于所有的元数据处理都已经完成，这带来了更少的内存使用和更快的启动时间。

source: As shown in the <<developing-with-flyway>> section, to start using Flyway with your project, you just need to:
zh_cn: 参照 <<用flyway开发>> ，要开始在项目中使用Flyway，只需要：

source: As stated above, Quarkus provides the option of using JSON-B instead of Jackson via the use of the `quarkus-resteasy-jsonb` extension.
zh_cn: 如上所述，Quarkus通过使用 `quarkus-resteasy-jsonb` 扩展提供了使用JSON-B而不是Jackson的选项。

source: As the Vert.x API is asynchronous, our method returns a `Uni`. The content is written into the HTTP response when the asynchronous operation represented by the Uni completes.
zh_cn: 由于Vert.x API是异步的，我们的方法返回一个 `Uni` 对象 。当Uni所代表的异步操作完成后，内容将会被写入HTTP响应中。

source: As the injected instance is not available here we use `installMockForType`, this mock is used for both test methods
zh_cn: 由于注入的实例在这里不可用，我们使用了 `installMockForType` ，这个mock用在于所有两个测试方法中

source: As the list of commands which are supported out-of-box by both https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] and https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`] depends on what is available in https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`], then there might be case when you need a command which is not (yet) available via https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`].
zh_cn: https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] 和 https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`] 开箱即支持的命令列表取决于 https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] 所支持的命令，那么可能会出现你需要用的命令 https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] （还）不支持的情况。

source: As usual, Quarkus further simplifies things under the hood when running your application as a native executable.
zh_cn: 像往常一样，当您将应用程序作为本机可执行文件运行时，Quarkus 进一步简化了内部工作。

source: As usual, the application can be packaged using:
zh_cn: 像往常一样，该应用程序可以用以下方式打包：

source: As we are writing in a database, we must be in a transaction. This annotation starts a new transaction and commits it when the method returns. Quarkus automatically considers the method as _blocking_. Indeed, writing to a database using classic Hibernate is blocking. So, Quarkus calls the method on a worker thread you can block (and not an I/O thread).
zh_cn: 由于我们是往数据库中写入数据，所以必须使用事务。这个注解启动了一个新的事务，并在方法返回时提交它。Quarkus会自动认为这个方法是 _阻塞的_ 。事实上，使用常规的Hibernate方法向数据库写入是阻塞操作。所以，Quarkus会在一个可阻塞的工作线程中调用这个方法(而不是在I/O线程中)。

source: As we are writing to the database, make sure we run inside a transaction
zh_cn: 当我们向数据库中写入数据时，请确保运行在事务中

source: As we have seen above, the API exposes five Rest endpoints. In this section we are going to see how to initialise an increment, see the list of current increments, incrementing a value given its key, retrieving the current value of an increment, and finally deleting a key.
zh_cn: 从上文可以看到，该API服务暴露了五个Restful接口。在这一节中，我们将看到如何初始化一个增量，查看当前的增量列表，给指定键的值递增，查询一个增量的当前值，以及删除一个键。

source: As we have seen, the event bus is the connecting tissue of Vert.x applications. Quarkus integrates it so different beans can interact with asynchronous messages. This part is covered in the xref:reactive-event-bus.adoc[event bus documentation].
zh_cn: 正如我们所见，事件总线是 Vert.x 应用程序之间的连接桥梁。 Quarkus 集成了它，因此不同的bean之间能够以异步消息的方式进行交互。这部分内容包含在 xref:reactive-event-bus.adoc[事件总线文档] 中。

source: As we saw in the MongoDB with Panache guide, it allows us to extend the functionality in our entities and repositories (also known as DAOs) with some automatically provided functionality. When using Kotlin, the approach is very similar to what we see in the Java version with a slight change or two. To Panache-enable your entity, you would define it something like:
zh_cn: 正如我们在MongoDB with Panache指南中所看到的，它允许我们用一些自动提供的功能来扩展我们实体和存储库（也称为DAO）中的功能。在使用Kotlin时，该方法与我们在Java版本中看到的非常相似，只是有一两个微小的变化。为了使你的实体具有Panache功能，你可以这样定义它：

source: As we want to use configuration properties obtained from the Config Server, we will update the `GreetingResource` to inject the `message` property. The updated code will look like this:
zh_cn: 由于我们想使用从配置服务器(Config Server)中获取到的配置属性，我们将更新 `GreetingResource` 以注入 `message` 属性。更新后的代码将如下所示:

source: As with the previous `Message` example, if your injected channel receives payloads (`Multi<T>`), it acknowledges the message automatically, and support multiple subscribers. If you injected channel receives Message (`Multi<Message<T>>`), you will be responsible for the acknowledgment and broadcasting. We will explore sending broadcast messages in <<broadcasting-messages-on-multiple-consumers>>.
zh_cn: 如前面 `Message` 例子所示，如果您的注入channel接收到了playloads( `Multi<T>` )，它可以支持多订阅者自动确认消息。如果您的注入channel收到Message( `Multi<Message<T>>` )，那么您需要自行负责消息确认和广播。我们将在<<broadcasting-messages-on-multiple-consumers>> 中探讨消息的发送和广播。

source: As you can see in the previous snippet, you can use xref:config-reference.adoc#profiles[profiles] in YAML. The profile key requires double quotes: `"%test"`. This is because YAML does not support keys starting with `%`.
zh_cn: 正如你在之前的代码片段中所看到的，你可以在YAML中使用 link:config-reference.html#profiles[profiles] 。该环境配置的key 需要使用双引号: `"%test"` 。这是因为YAML不支持以 `%` 开始的键。

source: As you can see our entities remain simple. There is, however, a slight difference from the Java version. The Kotlin language doesn't support the notion of static methods in quite the same way as Java does. Instead, we must use a https://kotlinlang.org/docs/tutorials/kotlin-for-py/objects-and-companion-objects.html#companion-objects[companion object]:
zh_cn: 如你所见，我们的实体仍然很简单。然而，与Java版本有一点不同。Kotlin语言并不像Java那样支持静态方法的概念。相反，我们必须使用一个 link:https://kotlinlang.org/docs/tutorials/kotlin-for-py/objects-and-companion-objects.html#companion-objects[companion object（同伴对象）] ：

source: Aside from debug symbols, setting `-Dquarkus.native.debug.enabled=true` flag generates a cache of source files for any JDK runtime classes, GraalVM classes and application classes resolved during native executable generation. This source cache is useful for native debugging tools, to establish the link between the symbols and matching source code. It provides a convenient way of making just the necessary sources available to the debugger/IDE when debugging a native executable.
zh_cn: 除了调试符号外，设置 `-Dquarkus.native.debug.enabled=true` 标志会生成一个源文件缓存，用于生成原生可执行文件时解决的任何JDK运行时类、GraalVM类和应用程序类。这个源码缓存对原生调试工具很有用，可以在符号和匹配的源代码之间建立联系。在调试本原生执行文件时，它提供了一种方便的方法，使调试器/IDE仅能获得必要的源文件。

source: Ask on <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow with the <code>quarkus</code> tag</a>
zh_cn: 在<a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow的<code>quarkus</code>标签</a>下提问题。

source: Ask your questions on <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow</a>. After the documentation, it’s probably the best place to look for answers. We actively monitor the <a href="https://stackoverflow.com/questions/tagged/quarkus">Quarkus tag</a>.
zh_cn: 在<a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow</a>上提出您的问题。在文档化之后，它可能是寻找答案的最佳地方。我们积极跟踪<a href="https://stackoverflow.com/questions/tagged/quarkus">Quarkus标签</a>。

source: Assuming `/tmp/` is writable this can be fixed by setting the `vertx.cacheDirBase` property to point to a directory in `/tmp/` for instance in OpenShift by creating an environment variable `JAVA_OPTS` with the value `-Dvertx.cacheDirBase=/tmp/vertx`.
zh_cn: 假设 `/tmp/` 是可写的，可以通过将 `vertx.cacheDirBase` 属性设置为指向 `/tmp/` 中的目录来修复此问题，例如在OpenShift中，通过创建一个值为 `-Dvertx.cacheDirBase=/tmp/vertx` ,名为 `JAVA_OPTS` 的环境变量。

source: Asynchronous processing
zh_cn: 异步处理

source: At that point you should have the following structure:
zh_cn: 此时，你应该有如下的结构：

source: At the moment, when JSON-B or Jackson tries to get the list of fields of a class, if the class is not registered for reflection, no exception will be thrown. GraalVM will simply return an empty list of fields.
zh_cn: 目前，当JSON-B或Jackson尝试获取一个类的字段列表时，如果该类没有注册反射，则不会抛出异常。GraalVM将简单地返回一个空的字段列表。

source: Attribute (_alias_)
zh_cn: 属性 _（别名）_

source: Attribute values are resolved as follows:
zh_cn: 属性值的解决方式如下：

source: Auth Type
zh_cn: 认证类型

source: Authentication mechanisms
zh_cn: 认证机制

source: Authentication with OAuth
zh_cn: 用OAuth进行认证

source: Authorization
zh_cn: 授权

source: Authorization is based on user roles that are provided by the security provider. To customize these roles, a `SecurityIdentityAugmentor` can be created, see xref:security-customization.adoc#security-identity-customization[Security Identity Customization].
zh_cn: 授权是基于security provider所提供的用户角色来进行的。为了自定义这些角色，可以创建一个 `SecurityIdentityAugmentor` 。请参考 xref:security-customization.adoc#security-identity-customization[Security Identity Customization].

source: Authorization of Web Endpoints
zh_cn: 网络端点的授权

source: Authorization using Annotations
zh_cn: 使用注解的授权

source: Authorization using Configuration
zh_cn: 使用配置进行授权

source: Automatic Service Setup with Dev Services
zh_cn: 使用开发服务的自动服务设置

source: Automatic provisioning and application wiring of supporting services such as databases, identity servers, and more.
zh_cn: 支持服务(如数据库、标识服务器等)的自动配置和应用程序连接。

# Automatically add newline with `curl -w " "`
source: Automatically add newline with `curl -w "\n"`
zh_cn: 自动添加换行符 `curl -w "\n"`

source: Available APIs
zh_cn: 可用的API

source: Available properties to customize the Redis DevService.
zh_cn: Redis DevService的可用配置属性：

source: Avro Serialization
zh_cn: Avro序列化

source: Await completion of the consumer task.
zh_cn: 等待消费者任务的完成。

source: Awards
zh_cn: 获奖

source: Azure Event Hubs for Kafka is not available in the _basic_ tier. You need at least the _standard_ tier to use Kafka. See https://azure.microsoft.com/en-us/pricing/details/event-hubs/[Azure Event Hubs Pricing] to see the other options.
zh_cn: Azure Event Hubs for Kafka在 _基础(basic)_ 层中不可用。您至少需要 _标准(standard)_ 层才能使用Kafka。请参阅 link:https://azure.microsoft.com/en-us/pricing/details/event-hubs/[Azure Event Hubs定价] 查看其他选项。

source: Azure Functions (Serverless) with Vert.x Web, Servlet, or RESTEasy
zh_cn: 使用Vert.x Web、Servlet或RESTEasy的Azure Functions（无服务器）

source: Back Pressure and Credits
zh_cn: 背压和信用

source: Back to our `producer` project. Let's modify the `QuotesResource` to consume quotes, bind it to an HTTP endpoint to send events to clients:
zh_cn: 回到我们的 `producer` 项目。让我们修改 `QuotesResource` 来消费报价，将其绑定到一个HTTP端点，来向客户端发送事件：

source: Backpressure
zh_cn: 背压

source: Base Runtime Image for Native Executables
zh_cn: 原生可执行文件的基本运行时镜像

source: Be Guided Through First Application
zh_cn: 指导您完成第一个应用

source: Be careful that locks are released when the transaction ends, so the method that invokes the lock query must be annotated with the `@Transactional` annotation.
zh_cn: 请注意，事务结束时锁会被释放，所以调用了带锁查询的方法必须加上 `@Transactional` 注解。

source: Be careful that locks are released when the transaction ends, so the method that invokes the lock query must be called within a transaction.
zh_cn: 请注意，事务结束时锁会被释放，所以带锁查询的方法必须在事务中调用。

source: Be careful to use the `@Transactional` annotation on the operations that modify the database, you can add the annotation at the class level for simplicity purpose.
zh_cn: 请注意，在修改数据库的操作上需要使用 `@Transactional` 注解，为了简单起见，你可以给类添加这个注解。

source: Be sure to call your `verify` and `do*` methods on `PanacheMock` rather than `Mockito`, otherwise you won't know what mock object to pass.
zh_cn: 请确保是在 `PanacheMock` 上调用 `verify` 和 `do*` 方法，而不是在 `Mockito` 上调用，否则无法传递mock对象。

source: Be sure to call your `verify` methods on `PanacheMock` rather than `Mockito`, otherwise you won't know what mock object to pass.
zh_cn: 请确保在 `PanacheMock` 而不是 `Mockito` 上调用你的 `verify` 方法，否则你将不知道要传递什么模拟对象。

source: Be sure to read the xref:cdi-reference.adoc#bean_discovery[Bean Discovery] section of the CDI guide for more information.
zh_cn: 请务必阅读CDI指南中的 link:cdi-reference.html#bean_discovery[Bean发现] 部分以了解更多信息。

source: Because Smallrye Reactive Messaging framework supports different messaging backends like Apache Kafka, AMQP, Apache Camel, JMS, MQTT, etc., it employs a generic vocabulary:
zh_cn: 因为Smallrye Reactive Messaging框架支持不同的消息后端，如Apache Kafka，AMQP，Apache Camel，JMS以及MQTT等，所以它使用了一个通用的术语表：

source: Because `GreetingResource` is annotated with `@Path("/hello")` the injected URL will end with `/hello`.
zh_cn: 因为 `GreetingResource` 用到了注解 `@Path("/hello")` ，注入的URL会以 `/hello` 结束。

source: Because of the additional class, our property names have changed. Let's update the properties file and the `GreetingResource` class.
zh_cn: 因为有了额外的类，我们的属性名也发生了改变。让我们更新一下属性配置文件和 `GreetingResource` 类。

source: Because of this, in the case of Maven, the version of the https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] must be set, as the default version does not support JUnit 5:
zh_cn: 正因为如此，就Maven而言，必须设置 link:https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] 的版本，因为默认版本不支持JUnit 5：
